# 2020-06-12
# 다양한 출력포맷 

# 빈 자리는 빈 공간으로 두고, 오른쪽 정렬을 하되, 총 10자리 공간을 확보
print("{0: >10}".format(500))

# 양수일 때는 +로 표시, 음수일 때는 -로 표시
print("{0: >+10}".format(-500))

# 왼쪽 정렬하고, 빈칸을 _로 채움
print("{0:_<10}".format(500))

# 3자리마다 콤마를 찍어주기
print("{0:,}".format(1000000000000))

# 3자리마다 콤마를 찍어주고 +- 부호도 붙이기
print("{0:+,}".format(1000000000000))
print("{0:+,}".format(-1000000000000))

# 3자리마다 콤마를 찍어주고, +-부호도 뿥이고, 자릿수도 확보하기
# 빈 자리는 ^로 채우기 
print("{0:^<30,}".format(1000000000000))

# 소수점을 출력하기
print("{0:f}".format(5/3))

# 소수점 특정 자리수 까지만 표시하기 
# f 앞에다가 .n 쓰기 
# 소수점 셋째 자리에서 반올림 하라는 뜻 
print("{0:.2f}".format(5/3))
